<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Common — описание модуля / пункта меню
    |--------------------------------------------------------------------------
    */
    'common' => [

        // ID записи в menus
        'id' => 287,

        // Название в меню
        'name' => 'Git',

        // Уникальный ключ модуля
        'shortname' => 'git_module',

        // Родительский раздел
        'parent_id' => 0,

        // Корневая сущность
        'is_root' => null,

        // Создавать API
        'is_api' => null,

        // Иконка меню
        'icon' => 'uil uil-github-alt',

        // ACL / permissions resource
        'resource' => 'git_module',

        // Активен
        'status' => null,

        // Порядок в меню
        'nom' => null,

        // Не справочник
        'is_list' => null,
    ],

];
