<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Common — описание модуля / пункта меню
    |--------------------------------------------------------------------------
    */
    'common' => [

        // ID записи в menus
        'id' => 2009,

        // Название в меню
        'name' => 'Справочники',

        // Уникальный ключ модуля
        'shortname' => 'main.references',

        // Родительский раздел
        'parent_id' => 2000,

        // Корневая сущность
        'is_root' => null,

        // Создавать API
        'is_api' => null,

        // Уровень вложенности
        'level' => 2,

        // Иконка меню
        'icon' => 'uil uil-book-open',

        // ACL / permissions resource
        'resource' => 'references',

        // Активен
        'status' => 1,

        // Порядок в меню
        'nom' => 6,

        // Не справочник
        'is_list' => null,
    ],

];
